tests/load/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 180
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 200
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  
  defaults:
    headers:
      Content-Type: "application/json"
      X-API-Key: "test-api-key"
  
  ensure:
    thresholds:
      - http.response_time.p99: 2000
      - http.response_time.p95: 1000
      - http.response_time.median: 500
      - http.codes.200: 95
    conditions:
      - expression: "http.codes.500 < 1"
        strict: true
  
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  
scenarios:
  - name: "Payment Intent Creation Flow"
    weight: 40
    flow:
      - post:
          url: "/api/v1/intents"
          name: "Create Payment Intent"
          json:
            merchant_id: "merchant-001"
            order_ref: "load-test-{{ $randomNumber() }}"
            target_amount: "{{ $randomNumber(100, 10000) }}"
            target_asset: "USDC"
            target_chain: "8453"
            accepted_assets: ["ETH", "USDC", "USDT"]
          expect:
            - statusCode: 201
            
      - think: 2
      
      - get:
          url: "/api/v1/intents/{{ intentId }}"
          name: "Get Payment Intent"
          expect:
            - statusCode: 200

  - name: "Quote Generation Flow"
    weight: 30
    flow:
      - post:
          url: "/api/v1/intents"
          name: "Create Intent for Quote"
          json:
            merchant_id: "merchant-001"
            order_ref: "quote-test-{{ $randomNumber() }}"
            target_amount: "{{ $randomNumber(100, 5000) }}"
            target_asset: "USDC"
            target_chain: "8453"
            accepted_assets: ["ETH", "USDC"]
          expect:
            - statusCode: 201
            
      - post:
          url: "/api/v1/intents/{{ intentId }}/quote"
          name: "Generate Quote"
          json:
            rate: "{{ $randomNumber(1800, 2200) }}"
            deposit_address: "0x{{ $randomHex(40) }}"
            deposit_asset: "ETH"
            deposit_chain: "1"
          expect:
            - statusCode: 200

  - name: "Compliance Screening Flow"
    weight: 20
    flow:
      - post:
          url: "/api/v1/compliance/screen"
          name: "Screen Address"
          json:
            address: "0x{{ $randomHex(40) }}"
            chain: "8453"
            amount: "{{ $randomNumber(100, 100000) }}"
            type: "INTENT_CREATION"
          expect:
            - statusCode: 200
            
      - think: 1

  - name: "Health Check Flow"
    weight: 10
    flow:
      - get:
          url: "/health"
          name: "Health Check"
          expect:
            - statusCode: 200
            
      - get:
          url: "/health/ready"
          name: "Readiness Check"
          expect:
            - statusCode: 200